
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОказаниеУслуг.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОказаниеУслуг.Дата,
	|	ОказаниеУслуг.Мастер,
	|	ОказаниеУслуг.Номер,
	|	ОказаниеУслуг.Услуга,
	|	ОказаниеУслуг.ПереченьМатериалов.(
	|		НомерСтроки,
	|		Материал,
	|		Склад,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	|ГДЕ
	|	ОказаниеУслуг.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПереченьМатериаловШапка = Макет.ПолучитьОбласть("ПереченьМатериаловШапка");
	ОбластьПереченьМатериалов = Макет.ПолучитьОбласть("ПереченьМатериалов");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПереченьМатериаловШапка);
		ВыборкаПереченьМатериалов = Выборка.ПереченьМатериалов.Выбрать();
		Пока ВыборкаПереченьМатериалов.Следующий() Цикл
			ОбластьПереченьМатериалов.Параметры.Заполнить(ВыборкаПереченьМатериалов);
			ТабДок.Вывести(ОбластьПереченьМатериалов, ВыборкаПереченьМатериалов.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;      
	ОбластьВсего=Макет.ПолучитьОбласть("Всего");
	СсылкаДокумента = Ссылка[0];
	ОбластьВсего.Параметры.ВсегоПоДокументу=СсылкаДокумента.ПереченьМатериалов.Итог("Сумма"); 
	ТабДок.Вывести(ОбластьВсего);
	//}}
КонецПроцедуры     

