Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. КОНТРОЛЬ ОСТАТКОВ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереченьМатериалов.Материал КАК Товар,
		|	СУММА(ПереченьМатериалов.Количество) КАК Количество
		|ПОМЕСТИТЬ ДОК
		|ИЗ
		|	Документ.ОказаниеУслуг.ПереченьМатериалов КАК ПереченьМатериалов
		|ГДЕ
		|	ПереченьМатериалов.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПереченьМатериалов.Материал
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиОстатки.Товар КАК Товар,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОСТ
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки КАК ОстаткиОстатки
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОК.Товар КАК Товар,
		|	ДОК.Количество КАК Количество,
		|	ОСТ.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ДОК КАК ДОК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОСТ КАК ОСТ
		|		ПО ДОК.Товар = ОСТ.Товар
		|УПОРЯДОЧИТЬ ПО
		|	Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТовар.Следующий() Цикл
		Если ВыборкаТовар.Количество > ВыборкаТовар.КоличествоОстаток Тогда
			Сообщить("Не хватает товара: " + ВыборкаТовар.Товар);
			Сообщить("Не хватает: " + (ВыборкаТовар.Количество - ВыборкаТовар.КоличествоОстаток));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// 2. ДВИЖЕНИЯ ПО РЕГИСТРУ
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из ПереченьМатериалов Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаМатериалы.Материал;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;
	
КонецПроцедуры