
Процедура ДоговорОферта(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ДоговорОферта)
	Макет = Документы.ЗачисленияВГруппу.ПолучитьМакет("ДоговорОферта");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗачисленияВГруппу.Адрес,
	|	ЗачисленияВГруппу.Школа,  
	|   ЗачисленияВГруппу.Льготник,
	|	ЗачисленияВГруппу.СоставГруппы.(
	|		Студент,
	|		СтоимостьОбучения
	|	)
	|ИЗ
	|	Документ.ЗачисленияВГруппу КАК ЗачисленияВГруппу
	|ГДЕ
	|	ЗачисленияВГруппу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставГруппыШапка = Макет.ПолучитьОбласть("СоставГруппыШапка");
	ОбластьСоставГруппы = Макет.ПолучитьОбласть("СоставГруппы");
	ОбластьИтог = Макет.ПолучитьОбласть("Итого");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСоставГруппыШапка); 
		СуммаИтог = 0;
		ВыборкаСоставГруппы = Выборка.СоставГруппы.Выбрать();
		Пока ВыборкаСоставГруппы.Следующий() Цикл  
			ЦенаВСтроке = ?(Выборка.Льготник, 0, ВыборкаСоставГруппы.СтоимостьОбучения);
			ОбластьСоставГруппы.Параметры.Заполнить(ВыборкаСоставГруппы);
			ОбластьСоставГруппы.Параметры.СтоимостьОбучения = ЦенаВСтроке;
			ТабДок.Вывести(ОбластьСоставГруппы, ВыборкаСоставГруппы.Уровень()); 
			СуммаИтог = СуммаИтог + ЦенаВСтроке;
		КонецЦикла;
		ОбластьИтог.Параметры.СуммаЦифрами = Формат(СуммаИтог, "ЧДЦ=2; ЧРД=,");
		ОбластьИтог.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтог, ,
			"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ТабДок.Вывести(ОбластьИтог);                    	

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
