
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СоставГрупп Приход
	Движения.СоставГрупп.Записывать = Истина;
	Для Каждого ТекСтрокаСоставГруппы Из СоставГруппы Цикл
		Движение = Движения.СоставГрупп.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Группа = Группа;
		Движение.Студент = ТекСтрокаСоставГруппы.Студент;
		Движение.ФлагОбучения = 1; 
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереводНаСледующийУровень") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.НоваяГруппа;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры 




Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	    МаксимумМест = Группа.Курс.МаксимумМестВГруппе;
		// Считаем, сколько студентов уже в группе (исключая переведенных)
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(Активные.Студент) КАК КоличествоАктивных
    |ИЗ
    |    (ВЫБРАТЬ
    |        СоставГрупп.Студент КАК Студент
    |    ИЗ
    |        РегистрНакопления.СоставГрупп КАК СоставГрупп
    |    ГДЕ
    |        СоставГрупп.Группа = &Группа
    |        И СоставГрупп.ФлагОбучения = 1
    |        И СоставГрупп.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |        И НЕ СоставГрупп.Студент В (
    |            ВЫБРАТЬ Внутренний.Студент
    |            ИЗ РегистрНакопления.СоставГрупп КАК Внутренний
    |            ГДЕ Внутренний.Группа = СоставГрупп.Группа
    |              И Внутренний.Студент = СоставГрупп.Студент
    |              И Внутренний.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |        )
    |    ) КАК Активные";
	
	Запрос.УстановитьПараметр("Группа", Группа);
    
    Результат = Запрос.Выполнить().Выбрать();
    Результат.Следующий();
    ТекущееКоличество = Результат.КоличествоАктивных; 
	КоличествоНовых = СоставГруппы.Количество();
	Если (ТекущееКоличество + КоличествоНовых) > МаксимумМест Тогда
        Сообщить("В группе нет свободных мест!");
        Отказ = Истина;
		Возврат; // для выхода из процедуры
    КонецЕсли;
	
	
	
        // нужно для пересчета цены для каждого студента с учетом скидки, если какая - то строка была удалена
            
        Курс = Группа.Курс;
        БазоваяЦена = РаботаСРегистром.СтоимостьКурса(Дата, Курс);
     
        ЦенаСоСкидкой = РасчетыОбучения.РассчитатьСтоимостьСоСкидкой(Курс, КоличествоНовых, БазоваяЦена);
        
        Для Каждого Строка Из СоставГруппы Цикл
            Строка.СтоимостьОбучения = ЦенаСоСкидкой;
		КонецЦикла; 
		
        
    
    
КонецПроцедуры


