
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенежныхСредств.Сумма КАК Сумма
		|ПОМЕСТИТЬ Расход
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеСредствОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ Регистр
		|ИЗ
		|	РегистрНакопления.ДвижениеСредств.Остатки КАК ДвижениеСредствОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расход.Сумма КАК Сумма,
		|	Регистр.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	Регистр КАК Регистр,
		|	Расход КАК Расход";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сумма > ВыборкаДетальныеЗаписи.СуммаОстаток тогда Сообщить("Нет денег!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	// регистр ДвижениеСредств Расход
	Движения.ДвижениеСредств.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ДвижениеСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВидСтатьиДДС = ТекСтрокаСостав.СтатьяДДС.ВидСтатьи;
		Движение.СтатьяДДС = ТекСтрокаСостав.СтатьяДДС;
		Движение.Дата = Дата;
		Движение.Сумма = ТекСтрокаСостав.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
