
&НаСервере
Функция СтудентПриИзмененииНаСервере()
	ПолучитьКартинку = ПолучитьНавигационнуюСсылку(Объект.Студент.Картинка,"Файл");
	Возврат(ПолучитьКартинку);
	
КонецФункции

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	Записать();
    Фото = СтудентПриИзмененииНаСервере() ;
    Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	Фото = СтудентПриИзмененииНаСервере() ;
    Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
	
	Если Объект.Красота=0 тогда
    Элементы.Красота.Видимость=Ложь ;
	Элементы.СбросКрасота.Видимость=Ложь;
	КонецЕсли;    

	Если Объект.Порядочность=0 тогда
    Элементы.Порядочность.Видимость=Ложь ;
	Элементы.СбросПорядочность.Видимость=Ложь;
	КонецЕсли;   

	Если Объект.Остроумие=0 тогда
    Элементы.Остроумие.Видимость=Ложь ;
	Элементы.СбросОстроумие.Видимость=Ложь;
	КонецЕсли;

	Если Объект.Состоятельность=0 тогда
    Элементы.Состоятельность.Видимость=Ложь ;
	Элементы.СбросСостоятельность.Видимость=Ложь;
	КонецЕсли;     

	Если Объект.ВредныеПривычки=0 тогда
    Элементы.ВредныеПривычки.Видимость=Ложь ;
	Элементы.СбросВредныеПривычки.Видимость=Ложь;
	КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура СбросКрасотаНаСервере()
	Объект.Красота = 0;
КонецПроцедуры

&НаКлиенте
Процедура СбросКрасота(Команда) 
	Красота = 0;  
	СбросКрасотаНаСервере();


	Элементы.Красота.Видимость=Ложь ;
	Элементы.СбросКрасота.Видимость=Ложь;
	Записать()
КонецПроцедуры

&НаСервере
Процедура СбросПорядочностьНаСервере()
	 Объект.Порядочность = 0;

КонецПроцедуры

&НаКлиенте
Процедура СбросПорядочность(Команда)
	Порядочность = 0;
	СбросПорядочностьНаСервере();  
	Элементы.Порядочность.Видимость=Ложь ;
	Элементы.СбросПорядочность.Видимость=Ложь;
	Записать()

КонецПроцедуры

&НаСервере
Процедура СбросОстроумиеНаСервере()
	Объект.Остроумие = 0;
КонецПроцедуры

&НаКлиенте
Процедура СбросОстроумие(Команда)
	Остроумие = 0;
	СбросОстроумиеНаСервере();  
	Элементы.Остроумие.Видимость=Ложь ;
	Элементы.СбросОстроумие.Видимость=Ложь;
	Записать()

КонецПроцедуры

&НаСервере
Процедура СбросСостоятельностьНаСервере()
	Объект.Состоятельность = 0;
КонецПроцедуры

&НаКлиенте
Процедура СбросСостоятельность(Команда)
	Состоятельность = 0;
	СбросСостоятельностьНаСервере(); 
	Элементы.Состоятельность.Видимость=Ложь ;
	Элементы.СбросСостоятельность.Видимость=Ложь;
	Записать()
КонецПроцедуры

&НаСервере
Процедура СбросВредныеПривычкиНаСервере()   
	Объект.ВредныеПривычки = 0;

	
КонецПроцедуры

&НаКлиенте
Процедура СбросВредныеПривычки(Команда) 
	ВредныеПривычки = 0;
	СбросВредныеПривычкиНаСервере();
	Элементы.ВредныеПривычки.Видимость=Ложь ;
	Элементы.СбросВредныеПривычки.Видимость=Ложь;
	Записать()

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
КонецПроцедуры
