
&НаКлиенте
Процедура ПереченьМатериаловКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПереченьМатериалов.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьМатериаловЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПереченьМатериалов.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТЧ);

КонецПроцедуры

&НаКлиенте
Процедура ПереченьМатериаловМатериалПриИзменении(Элемент)
	Строка=Элементы.ПереченьМатериалов.ТекущиеДанные;
	Строка.Цена=РаботаСРегистрами.РозничнаяЦена(Объект.Дата,Строка.Материал);
	РаботаСДокументами.РассчитатьСумму (Строка)
КонецПроцедуры