
&НаСервере
Процедура ДобавитьФотоНаСервере()
	НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайл.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото=ПоместитьВоВременноеХранилище (НовыйФайл.Файл.Получить ());
	НовыйФайл.Записать();
	Объект.Фото = НовыйФайл.Ссылка;                     

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото(Команда) 
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда
	Фото = ПутьФайла;

	ДобавитьФотоНаСервере();   
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    Фото = ПолучитьНавигационнуюСсылку(Объект.Фото, "Файл");
    Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация",ПоложениеЗаголовкаЭлементаФормы.Лево);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры         

&НаКлиенте

Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)

 

УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);

 

КонецПроцедуры

 

&НаКлиенте

Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

 

УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);

 

КонецПроцедуры

 

&НаКлиенте

Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)

 

УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);

 

КонецПроцедуры

 

&НаКлиенте

Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)

 

УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);

 

КонецПроцедуры

 

&НаКлиенте

Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)

 

УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);

 

КонецПроцедуры

 

&НаКлиенте
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат)
	УправлениеКонтактнойИнформациейКлиент.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Результат);
КонецПроцедуры

