
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ДоговорОферта)
	ТабДок = Новый ТабличныйДокумент;
	ДоговорОферта(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ДоговорОферта(ТабДок, ПараметрКоманды)
	Документы.ЗачисленияВГруппу.ДоговорОферта(ТабДок, ПараметрКоманды);
КонецПроцедуры
