
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЖурналГолосований
	Движения.ЖурналГолосований.Записывать = Истина;
	Движение = Движения.ЖурналГолосований.Добавить();
	Движение.Студент = Студент;
	Движение.Пользователь = Пользователь;
	Движение.Красота = Красота;
	Движение.Порядочность = Порядочность;
	Движение.Остроумие = Остроумие;
	Движение.Состоятельность = Состоятельность;
	Движение.ВредныеПривычки = ВредныеПривычки;
	Движение.Рейтинг = (Красота+Порядочность+Остроумие+Состоятельность+10-ВредныеПривычки)/5;
	Движение.Женат = Студент.Женат;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    // Проверяем, голосовал ли уже этот пользователь за этого студента
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(*) КАК Количество
    |ИЗ
    |    РегистрСведений.ЖурналГолосований
    |ГДЕ
    |    Студент = &Студент
    |    И Пользователь = &Пользователь
    |    И Регистратор <> &Регистратор";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    
    Результат = Запрос.Выполнить().Выбрать();
    Результат.Следующий();
    
    Если Результат.Количество > 0 Тогда
        Сообщить("Вы уже голосовали за этого студента. 
        |Повторное голосование невозможно.", СтатусСообщения.Внимание);
        Отказ = Истина;
    КонецЕсли;
    
КонецПроцедуры