
&НаСервере
Процедура ДобавитьФотоНаСервере()
	НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайл.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото=ПоместитьВоВременноеХранилище (НовыйФайл.Файл.Получить ());
	НовыйФайл.Записать();
	Объект.Картинка = НовыйФайл.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото(Команда)
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда
	Фото = ПутьФайла;
    ДобавитьФотоНаСервере();

	КонецЕсли;
КонецПроцедуры       


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
    Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры
	